; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared4 - mode
	infrared6 - mode
	image1 - mode
	infrared3 - mode
	infrared0 - mode
	image5 - mode
	thermograph7 - mode
	image2 - mode
	spectrograph8 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star6 - direction
	Star7 - direction
	Star5 - direction
	Star2 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph7)
	(supports instrument0 infrared4)
	(supports instrument0 image2)
	(supports instrument0 image5)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph7)
	(supports instrument1 spectrograph8)
	(supports instrument1 infrared0)
	(supports instrument1 infrared6)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Star8 infrared6)
	(have_image Star9 image2)
	(have_image Star9 spectrograph8)
	(have_image Star9 infrared6)
	(have_image Planet10 thermograph7)
	(have_image Planet10 image2)
	(have_image Planet10 image5)
	(have_image Planet11 infrared4)
	(have_image Star12 image1)
	(have_image Star12 infrared3)
	(have_image Planet13 image1)
	(have_image Planet13 thermograph7)
	(have_image Planet13 infrared0)
))

)

; plan
1. (turn_to satellite0 star2 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star2)
   goals met: 0 of 13
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 13
3. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 13
4. (turn_to satellite0 star9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star9)
   goals met: 0 of 13
5. (take_image satellite0 star9 instrument1 spectrograph8)
   added: (have_image star9 spectrograph8)
   goals met: 1 of 13
6. (take_image satellite0 star9 instrument1 infrared6)
   added: (have_image star9 infrared6)
   goals met: 2 of 13
7. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 2 of 13
8. (take_image satellite0 star8 instrument1 infrared6)
   added: (have_image star8 infrared6)
   goals met: 3 of 13
9. (turn_to satellite0 star12 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star12)
   goals met: 3 of 13
10. (take_image satellite0 star12 instrument1 infrared3)
   added: (have_image star12 infrared3)
   goals met: 4 of 13
11. (turn_to satellite0 planet13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet13)
   goals met: 4 of 13
12. (take_image satellite0 planet13 instrument1 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 5 of 13
13. (turn_to satellite0 star5 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star5)
   goals met: 5 of 13
14. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 5 of 13
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 13
16. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 5 of 13
17. (turn_to satellite0 planet10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet10)
   goals met: 5 of 13
18. (take_image satellite0 planet10 instrument0 image2)
   added: (have_image planet10 image2)
   goals met: 6 of 13
19. (take_image satellite0 planet10 instrument0 image5)
   added: (have_image planet10 image5)
   goals met: 7 of 13
20. (take_image satellite0 planet10 instrument0 thermograph7)
   added: (have_image planet10 thermograph7)
   goals met: 8 of 13
21. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 8 of 13
22. (take_image satellite0 planet11 instrument0 infrared4)
   added: (have_image planet11 infrared4)
   goals met: 9 of 13
23. (turn_to satellite0 planet13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet13)
   goals met: 9 of 13
24. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 10 of 13
25. (take_image satellite0 planet13 instrument0 thermograph7)
   added: (have_image planet13 thermograph7)
   goals met: 11 of 13
26. (turn_to satellite0 star12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star12)
   goals met: 11 of 13
27. (take_image satellite0 star12 instrument0 image1)
   added: (have_image star12 image1)
   goals met: 12 of 13
28. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 12 of 13
29. (take_image satellite0 star9 instrument0 image2)
   added: (have_image star9 image2)
   goals met: 13 of 13
